# StairsOpenEndConnection Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroupTypeId..::..StairsOpenEndConnection Property
GroupTypeId Class See Also
---
End Connection.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public static ForgeTypeId StairsOpenEndConnection { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsOpenEndConnection As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsOpenEndConnection {
	ForgeTypeId^ get ();
}
```

# See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace